# GetIntegerValue Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColorFillSchemeEntry..::..GetIntegerValue Method
ColorFillSchemeEntry Class See Also
---
Gets the Integer value stored within the entry.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public int GetIntegerValue()
```

Visual Basic
---
```text
Public Function GetIntegerValue As Integer
```

Visual C++
---
```text
public:
int GetIntegerValue()
```

# ### Return Value
The Integer value contained in the entry.
# Remarks
This method should only be used if the StorageType property reports the type of the entry as a Integer.
# See Also
ColorFillSchemeEntry Class
Autodesk.Revit.DB Namespace